#include <vector>

int x = 0;
int  f1() { return x; } // 값 "0" 반환  mov eax, 0 즉,
						//			약속된 장소에 x의 값인 0을 넣는다.
int& f2() { return x; } // x의 값이 아닌 메모리 정보(참조, 결국은 주소) 반환

int main()
{
	int v1 = 10, v2 = 10;
	
	// 모든 변수는 "이름", "값", "주소"가 있습니다.
	// 코드에서 "변수의 이름" 사용시.. 컴파일러는 "값" 또는 "메모리주소"로변경합니다
	v1 = 20; // v1의 메모리 주소를 가져오는 기계어 코드 = 20
	v2 = v1; // v2 = v1메모리에 있는 값을 가져오는 기계어 코드

	f1() = 10; // error. 0 = 10
	f2() = 10; // ok.    x = 10

	std::vector<int> v = { 1,2,3 };

	v[0] = 10; // v.operator[](0) = 10 으로 변경됩니다.
				// 함수호출(0) = 10     의 표기법 입니다. 
}

// 2:05분에 이어집니다.